/* 
№1 На странице юзер выделяет текст. По нажатию Ctrl + Enter запишите этот текст в буфер обмена.

№2 Дан текстареа. В него вводится текст. По нажатию клавиши Tab вставьте в место моргания курсора символ табуляции.

№3 Даны инпуты. В любой инпут можно ввести текст и нажать Enter. После этого текст из инпута исчезает. Сделайте так, чтобы каждый инпут запоминал 
введенные тексты. Над каждым инпутом разместите стрелочки, с помощью которых можно будет возвращать предыдущий введенный текст в инпут.

№4 Дано число. Выведите на экран процесс разложения числа на простые множители, как в школе.

№5 Дан многомерный объект произвольного уровня вложенности:

{
	a: {
		b: {
			c: '+++'
		}
	},
}
Сделайте функцию, которая будет возвращать элементы объекта, параметром получая строку с ключами объекта, разделенными точками:

func('a.b.c'); // вернет '+++'

№6 Дана таблица. По нажатию на кнопку заполните ее следующим образом:

№1 Дан инпут. Сделайте так, чтобы при вводе в него слова 'blur' этот инпут терял фокус.

№2 Дана таблица. По очереди выведите в нее все фигурки тетриса так, чтобы начало фигуры было в центре таблицы.

№3 Модифицируйте предыдущую задачу так, чтобы рядом с таблицей были кнопки, с помощью которых фигуры можно будет вращать.

№4 Сделайте скрипт, генерирующий квадратные уравнения с целыми корнями.

№5 Дан текстареа. В нем записан текст. Юзер выделяет несколько строк текста и нажимает клавишу Tab. Сделайте так, чтобы в начало каждой выделенной строки вставилась табуляция.

№6 Дана строка, содержащая в себе любое количество вложенных парных круглых скобок. Напишите код, который проверит, что скобки расположены корректно.
Так корректно: '()()' Так корректно: '(())'
Так некорректно, так как количество открытых скобок не совпадает с количеством закрытых: '())'
Так некорректно, так как, хотя количество открытых скобок и совпадает с количеством закрытых, но у них неправильный порядок: '))(('

№1 Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в одном ряду таблицы можно было активировать не более 5-ти ячеек.

№2 Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в одной колонке таблицы можно было активировать не более 5-ти ячеек.

№3 Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы для активированной ячейки нельзя было активировать ее соседей слева и справа.

№4 Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в для активированной ячейки нельзя было активировать ее соседей сверху и снизу.

№5 Дана инпут. В него вводится длинное слово. Выведите список слов, которые можно составить из букв введенного в инпут слова.

№6 Дан текстареа. В нем записан текст. Юзер выделяет несколько строк текста и нажимает клавишу Alt + Tab. Сделайте так, чтобы из начала каждой выделенной строки удалилась табуляция.

№7 Дана строка, содержащая две дроби и математическую операцию между ними: '2/3 + 3/4' Напишите код, который вычислит результат записанной 
математической операции.

№1 Дан массив. Выведите в консоль все варианты перестановки элементов этого массива.

№2 Напишите код, который нарисует радугу на канвасе.

№3 Даны два инпута и кнопка. По клику на кнопку выведите список список ul всех дружественных чисел из промежутка, заданном значениями инпутов.

№4 Дана форма с инпутами, текстареа, чебоксами, радиокнопками и селектами. Юзер как-то изменяет элементы формы. Сделайте так, чтобы после перезагрузки окна браузера все элементы формы пришли в то состояние, в котором их оставил юзер.

№5 Дана квадратная HTML таблица произвольного размера. По нажатию на кнопку транспонируйте ее, то есть завалите ее на бок. Посмотрим на примере. Пусть у нас есть вот такая таблица:

После транспонирования она должна превратится в следующую:

№1 Напишите код, который нарисует стрелку на канвасе. Острие стрелки должно указывать в заданную точку, а сама стрелка должна быть наклонена под заданным углом.

№2 Дан див, текстом которого является некоторый CSS код. Напишите скрипт, который выполнит подсветку синтаксиса этого кода.

№3 При заходе на страницу сайта покажите юзеру обратный отсчет, который закончится через час от момента захода юзера на сайт. Сделайте так, чтобы после обновления страницы, отсчет продолжался с того места, на котором он остановился.

№4 Напишите код, который сгенерирует таблицу, в которой случайным образом будут расставлены корабли для игры в морской бой.

№5 Дана HTML таблица, в которой в произвольных двух ячейках стоят плюсы:

По нажатию на кнопку заполните минусами все ячейки вокруг заданных следующим образом:

№1 Дана строка, содержащая в себе дробь: '12/16' апишите код, который распишет процесс сокращения дроби, как в школе: '12/16 = 6/8 = 3/4'

№2 Реализуйте алгоритм Решето Эратосфена для поиска простых чисел в заданном промежутке.

№3 Напишите код, который выведет на канвасе тикающие стрелочные часы, показывающие текущее время.

№4 Дана квадратная HTML таблица с четным количеством рядом и колонок. По нажатию на кнопку заполните центр таблицы следующим образом:



*/