/*
№1 Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в одном ряду таблицы можно было активировать не более 5-ти ячеек.

№2 Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в одной колонке таблицы можно было активировать не более 5-ти ячеек.

№3 Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы для активированной ячейки нельзя было активировать ее соседей слева и справа.

№4 Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в для активированной ячейки нельзя было активировать ее соседей сверху и снизу.

№5 Дана инпут. В него вводится длинное слово. Выведите список слов, которые можно составить из букв введенного в инпут слова.

№6 Дан текстареа. В нем записан текст. Юзер выделяет несколько строк текста и нажимает клавишу Alt + Tab. Сделайте так, чтобы из начала каждой выделенной строки удалилась табуляция.

№7 Дана строка, содержащая две дроби и математическую операцию между ними: '2/3 + 3/4' Напишите код, который вычислит результат записанной 
математической операции.
*/